Repository: PianoNic/Schuly
Catalog: schuly/lib/l10n/app_*.arb
Languages: de, nl

# noAccountAdded
source: No account added yet.
de: Noch kein Account hinzugefügt.
nl: Nog geen account toegevoegd.

source: Add Account
de: Account hinzufügen
nl: Account toevoegen

# noActiveAccount
source: No active account selected.
de: Kein aktiver Account ausgewählt.
nl: Geen actief account geselecteerd.

source: Select Account
de: Account auswählen
nl: Account selecteren

source: Personal Information
de: Persönliche Angaben
nl: Persoonlijke gegevens

source: Quick Actions
de: Schnellaktionen
nl: Snelle acties

source: App Settings
de: App Einstellungen
nl: App-instellingen

# designAndSettings
source: Customize design and settings
de: Design und Einstellungen anpassen
nl: Ontwerp en instellingen aanpassen

# helpAndSupport
source: Help & Support
de: Hilfe & Support
nl: Hulp & Ondersteuning

source: Get help and support
de: Hilfe und Support erhalten
nl: Krijg hulp en ondersteuning

source: Email Support
nl: E-mail ondersteuning

# contactByEmail
source: Contact me directly by email
de: Kontaktiere mich direkt per E-Mail
nl: Neem direct contact met mij op via e-mail

# bugReport
source: Bug Report / Feature Request
nl: Bug rapport / Functieverzoek

# reportBugsOrRequestFeatures
source: Report bugs or request new features
de: Melde Bugs oder schlage neue Features vor
nl: Meld bugs of vraag nieuwe functies aan

source: Copy
de: Kopieren
nl: Kopiëren

source: Copied to clipboard
de: In Zwischenablage kopiert
nl: Gekopieerd naar klembord

source: Error
de: Fehler
nl: Fout

# emailAppError
source: Could not open email app. Please contact us manually at: {email}
de: E-Mail-App konnte nicht geöffnet werden. Bitte kontaktieren Sie uns manuell unter: {email}
nl: Kon e-mail app niet openen. Neem handmatig contact met ons op via: {email}

# browserError
source: Could not open browser. Please visit manually: {url}
de: Browser konnte nicht geöffnet werden. Bitte besuchen Sie manuell: {url}
nl: Kon browser niet openen. Bezoek handmatig: {url}

source: Add Another Account
de: Weiteren Account hinzufügen
nl: Ander account toevoegen

source: Add multiple accounts
de: Mehrere Accounts hinzufügen
nl: Meerdere accounts toevoegen

source: Logout
de: Abmelden
nl: Uitloggen

# signOutFromApp
source: Sign out from the app
de: Aus der App abmelden
nl: Uitloggen uit de app

source: Name
nl: Naam

source: Street
de: Strasse
nl: Straat

source: ZIP City
de: PLZ Ort
nl: Postcode Plaats

source: Birth Date
de: Geburtsdatum
nl: Geboortedatum

source: Phone
de: Telefon
nl: Telefoon

source: Nationality
de: Nationalität
nl: Nationaliteit

source: Hometown
de: Heimatort
nl: Woonplaats

source: Mobile
de: Handy
nl: Mobiel

source: Profile 1
de: Profil 1
nl: Profiel 1

source: Profile 2
de: Profil 2
nl: Profiel 2

source: Grades
de: Noten
nl: Cijfers

source: Absences
de: Absenzen
nl: Afwezigheden

source: Language
de: Sprache
nl: Taal

source: Select Language
de: Sprache auswählen
nl: Selecteer taal

source: English
de: Englisch
nl: Engels

source: German
de: Deutsch
nl: Duits

source: Swiss German
de: Schwiizerdüütsch
nl: Zwitsers-Duits

source: Pirate
de: Piraten-Sprache
nl: Piraat

# arnold
source: Terminator
nl: Arnold

source: Cancel
de: Abbrechen
nl: Annuleren

source: Confirm
de: Bestätigen
nl: Bevestigen

source: Push Notifications
de: Push-Benachrichtigungen
nl: Pushmeldingen

source: Feature in development
de: Feature wird noch entwickelt
nl: Functie in ontwikkeling

# getNotified
source: Get notified before classes
de: Vor dem Unterricht benachrichtigt werden
nl: Ontvang meldingen voor lessen

# enableNotifications
source: Enable to receive notifications
de: Aktivieren, um Benachrichtigungen zu erhalten
nl: Inschakelen om meldingen te ontvangen

# notificationsEnabled
source: Notifications enabled successfully
de: Benachrichtigungen erfolgreich aktiviert
nl: Meldingen succesvol ingeschakeld

# notificationPermissionDenied
source: Notification permission denied. Please enable in settings.
de: Benachrichtigungsberechtigung verweigert. Bitte in den Einstellungen aktivieren.
nl: Melding toestemming geweigerd. Schakel in bij instellingen.

source: Configure Notifications
de: Benachrichtigungen konfigurieren
nl: Meldingen configureren

# chooseTypesAndTiming
source: Choose types and timing for notifications
de: Wählen Sie Typen und Timing für Benachrichtigungen
nl: Kies types en timing voor meldingen

source: What's New
de: Was ist neu
nl: Wat is nieuw

# changelogAndFeatures
source: Changelog and new features
de: Changelog und neue Features
nl: Wijzigingslog en nieuwe functies

source: Check for Updates
de: Nach Updates suchen
nl: Controleer op updates

source: Check for new versions
de: Auf neue Versionen prüfen
nl: Controleer op nieuwe versies

source: About App
de: Über die App
nl: Over de app

source: Version
nl: Versie

source: Delete
de: Löschen
nl: Verwijderen

source: Close
de: Schließen
nl: Sluiten

source: Add
de: Hinzufügen
nl: Toevoegen

source: Loading...
de: Lädt...
nl: Laden...

source: No events for this day
de: Keine Termine für diesen Tag
nl: Geen evenementen voor deze dag

# agendaForDate
source: Agenda for {day}.{month}.{year}
de: Termine für {day}.{month}.{year}
nl: Agenda voor {day}.{month}.{year}

# noAgendaForDay
source: No events for this day.
de: Keine Termine für diesen Tag.
nl: Geen evenementen voor deze dag.

source: Next Lessons
de: Nächste Lektionen
nl: Volgende lessen

source: Next Holidays
de: Nächste Ferien
nl: Volgende vakanties

source: Student ID Card
de: Schülerausweis
nl: Studentenkaart

source: Reload page
de: Seite neu laden
nl: Pagina herladen

source: Loading student ID card...
de: Schülerausweis wird geladen...
nl: Studentenkaart laden...

# enterValidEmail
source: Please enter a valid email address
de: Bitte geben Sie eine gültige E-Mail-Adresse ein
nl: Voer een geldig e-mailadres in

source: Are you sure?
de: Sind Sie sicher?
nl: Weet je het zeker?

source: Update Available!
de: Update verfügbar!
nl: Update beschikbaar!

source: Yes
de: Ja
nl: Ja

source: No
de: Nein
nl: Nee

source: Confirmed
de: Bestätigt
nl: Bevestigd

source: Lateness
de: Verspätungen
nl: Vertraging

source: No lateness found
de: Keine Verspätungen gefunden.
nl: Geen vertragingen gevonden

# selectReason
source: Please select a reason
de: Bitte wählen Sie einen Grund aus
nl: Selecteer een reden

# selectDate
source: Please select a date
de: Bitte wählen Sie ein Datum aus
nl: Selecteer een datum

source: Email Address
de: E-Mail-Adresse
nl: E-mailadres

source: Password
de: Passwort
nl: Wachtwoord

source: Login
de: Anmelden
nl: Inloggen

# enterEmailAddress
source: Please enter an email address
de: Bitte geben Sie eine E-Mail-Adresse ein
nl: Voer een e-mailadres in

source: Get new token
de: Neues Token holen
nl: Nieuw token ophalen

# getNewTokenSubtitle
source: Fetch a new token for the active account
de: Hole ein neues Token für den aktiven Account
nl: Haal een nieuw token op voor het actieve account

source: Token updated!
de: Token aktualisiert!
nl: Token bijgewerkt!

# noActiveAccountSnack
source: No active account!
de: Kein aktiver Account!
nl: Geen actief account!

# addAccountTitle
source: Add Account
de: Account hinzufügen
nl: Account toevoegen

source: Enter email
de: E-Mail eingeben
nl: Voer e-mail in

# passwordLabel
source: Password
de: Passwort
nl: Wachtwoord

source: Enter password
de: Passwort eingeben
nl: Voer wachtwoord in

source: Account added!
de: Account hinzugefügt!
nl: Account toegevoegd!

# logoutTitle
source: Logout
de: Abmelden
nl: Uitloggen

# logoutConfirm
source: Are you sure you want to log out?
de: Sind Sie sicher, dass Sie sich abmelden möchten?
nl: Weet je zeker dat je wilt uitloggen?

source: Logged out!
de: Abgemeldet!
nl: Uitgelogd!

source: Design Settings
de: Design Einstellungen
nl: Ontwerp instellingen

source: Appearance
de: Darstellung
nl: Uiterlijk

source: Automatic
de: Automatisch
nl: Automatisch

source: Light
de: Hell
nl: Licht

source: Dark
de: Dunkel
nl: Donker

source: Color Style
de: Farbstil
nl: Kleurstijl

source: Classic
de: Klassisch
nl: Klassiek

source: Neon Accent Color
de: Neon Akzentfarbe
nl: Neon accent kleur

source: Classic Accent Color
de: Klassische Akzentfarbe
nl: Klassieke accent kleur

source: Material You active
de: Material You aktiv
nl: Material You actief

# materialYouInfo
source: Colors are automatically taken from the system theme.
de: Farben werden automatisch vom Systemdesign übernommen
nl: Kleuren worden automatisch overgenomen van het systeemthema.

source: Neon Cyan
nl: Neon cyaan

source: Neon Green
de: Neon Grün
nl: Neon groen

source: Neon Pink
nl: Neon roze

source: Neon Orange
nl: Neon oranje

source: Neon Blue
de: Neon Blau
nl: Neon blauw

source: Neon Red
de: Neon Rot
nl: Neon rood

source: Neon Yellow
de: Neon Gelb
nl: Neon geel

source: Blue
de: Blau
nl: Blauw

source: Teal
de: Türkis
nl: Turkoois

source: Green
de: Grün
nl: Groen

source: Pink
nl: Roze

source: Orange
nl: Oranje

source: Red
de: Rot
nl: Rood

source: Yellow
de: Gelb
nl: Geel

source: Purple
de: Lila
nl: Paars

# previousLessonsDay
source: Previous day with lessons
de: Vorheriger Tag mit Lektionen
nl: Vorige dag met lessen

# nextLessonsDay
source: Next day with lessons
de: Nächster Tag mit Lektionen
nl: Volgende dag met lessen

source: No lessons found.
de: Keine Lektionen gefunden.
nl: Geen lessen gevonden.

# noLessonsForDay
source: No lessons for {day}.{month}.{year}
de: Keine Lektionen für {day}.{month}.{year}
nl: Geen lessen voor {day}.{month}.{year}

source: No holidays found.
de: Keine Ferien gefunden.
nl: Geen vakanties gevonden.

source: Latest grades
de: Letzte Noten
nl: Laatste cijfers

source: No grades found.
de: Keine Noten gefunden.
nl: Geen cijfers gevonden.

source: Open absences
de: Offene Absenzen
nl: Open afwezigheden

source: Show all
de: Alle anzeigen
nl: Toon alles

source: No absences found.
de: Keine Absenzen gefunden.
nl: Geen afwezigheden gevonden.

source: No open absences.
de: Keine offenen Absenzen.
nl: Geen open afwezigheden.

# noReleaseNotes
source: No release notes available
de: Keine Release Notes verfügbar
nl: Geen release notes beschikbaar

# releaseNotesInfo
source: Updates and new features will be shown here
de: Updates und neue Features werden hier angezeigt
nl: Updates en nieuwe functies worden hier getoond

source: Notification types
de: Benachrichtigungstypen
nl: Melding types

source: Timetable
de: Stundenplan
nl: Rooster

# agendaNotificationSubtitle
source: Notifications before lessons
de: Benachrichtigungen vor Unterrichtsstunden
nl: Meldingen voor lessen

# gradeNotificationSubtitle
source: Notifications for new grades
de: Benachrichtigungen bei neuen Noten
nl: Meldingen voor nieuwe cijfers

# absenceNotificationSubtitle
source: Notifications for absence changes
de: Benachrichtigungen bei Abwesenheitsänderungen
nl: Meldingen voor afwezigheidswijzigingen

source: General notifications
de: Allgemeine Mitteilungen
nl: Algemene meldingen

# generalNotificationSubtitle
source: Important school information and updates
de: Wichtige Schulinformationen und Updates
nl: Belangrijke schoolinformatie en updates

source: Notification time
de: Benachrichtigungszeit
nl: Meldingstijd

# notificationAdvanceQuestion
source: How many minutes before class do you want to be notified?
de: Wie viele Minuten vor Unterrichtsbeginn möchten Sie benachrichtigt werden?
nl: Hoeveel minuten voor de les wil je een melding ontvangen?

# currentAdvanceSetting
source: Current setting: {minutes} minutes before class
de: Aktuelle Einstellung: {minutes} Minuten vor Unterrichtsbeginn
nl: Huidige instelling: {minutes} minuten voor de les

source: Send test notification
de: Test-Benachrichtigung senden
nl: Stuur testmelding

# checkNotificationsWork
source: Check if notifications work
de: Prüfen Sie, ob Benachrichtigungen funktionieren
nl: Controleer of meldingen werken

source: Schedule test notification
de: Test-Benachrichtigung planen
nl: Plan testmelding

# testScheduledNotificationDesc
source: Receive a notification in 15 seconds (works when app is closed)
de: Erhalte eine Benachrichtigung in 15 Sekunden (funktioniert bei geschlossener App)
nl: Ontvang een melding over 15 seconden (werkt wanneer app gesloten is)

# notificationScheduledIn15Seconds
source: Notification scheduled! Close the app to test - appears in 15 seconds
de: Benachrichtigung geplant! App schließen zum Testen - erscheint in 15 Sekunden
nl: Melding gepland! Sluit de app om te testen - verschijnt over 15 seconden

# errorSchedulingNotification
source: Failed to schedule notification
de: Fehler beim Planen der Benachrichtigung
nl: Melding plannen mislukt

source: Test notification sent!
de: Test-Benachrichtigung gesendet!
nl: Testmelding verzonden!

# exactAlarmPermissionRequired
source: Exact alarm permission required. Please enable in settings.
de: Berechtigung für exakte Alarme erforderlich. Bitte in den Einstellungen aktivieren.
nl: Exacte alarm toestemming vereist. Schakel in bij instellingen.

source: Open Settings
de: Einstellungen öffnen
nl: Open instellingen

source: Grade Details
de: Notendetails
nl: Cijfer details

source: Basic Information
de: Grundinformationen
nl: Basisinformatie

# titleLabel
source: Title
de: Titel
nl: Titel

# subjectLabel
source: Subject
de: Fach
nl: Vak

# courseLabel
source: Course
de: Kurs
nl: Cursus

# dateLabel
source: Date
de: Datum
nl: Datum

# confirmedLabel
source: Confirmed
de: Bestätigt
nl: Bevestigd

# gradeLabel
source: Grade
de: Note
nl: Cijfer

# pointsLabel
source: Points
de: Punkte
nl: Punten

# weightLabel
source: Weight
de: Gewichtung
nl: Gewicht

# courseGradeLabel
source: Course Grade
de: Kursnote
nl: Cursuscijfer

source: Class Average
de: Klassenschnitt
nl: Klasgemiddelde

# examGroupLabel
source: Exam Group
de: Prüfungsgruppe
nl: Examengroep

# classAverageLabel
source: Class Average
de: Klassenschnitt
nl: Klasgemiddelde

# groupWeightLabel
source: Group Weight
de: Gruppengewichtung
nl: Groepsgewicht

# commentLabel
source: Comment
de: Kommentar
nl: Opmerking

# latestVersionMessage
source: You are already using the latest version.
de: Sie verwenden bereits die neueste Version.
nl: Je gebruikt al de nieuwste versie.

# versionWithNumber
source: Version {version}+{build}
nl: Versie {version}+{build}

# appLegalese
source: Schuly Â© 2025 PianoNic
de: Schuly © 2025 PianoNic
nl: Schuly © 2025 PianoNic

# appDescription
source: A custom app for students to manage Schulnetz data. Manage your timetable, grades, and important dates in one place.
de: Eine custom App für Schüler zur Verwaltung von Schulnetz-Daten. Verwalten Sie Ihren Stundenplan, Noten und wichtige Termine an einem Ort.
nl: Een aangepaste app voor studenten om Schulnetz-gegevens te beheren. Beheer je rooster, cijfers en belangrijke data op één plek.

source: API Endpoint
nl: API-eindpunt

# enterApiEndpoint
source: Please enter API endpoint
de: Bitte geben Sie den API Endpoint ein
nl: Voer API-eindpunt in

source: Current API Info
de: Aktuelle API Info
nl: Huidige API-info

source: Environment
de: Umgebung
nl: Omgeving

source: API Base URL
de: API Basis-URL
nl: API basis URL

source: Save
de: Speichern
nl: Opslaan

# apiUrlChanged
source: API URL changed: {url}
de: API URL geändert: {url}
nl: API URL gewijzigd: {url}

source: Get color name
de: Farbname abrufen
nl: Krijg kleurnaam

# lessonBreak
source: Break
de: Pause
nl: Pauze

source: Lunch Break
de: Mittagspause
nl: Lunchpauze

# showBreaks
source: Show breaks between lessons
de: Pausen zwischen Lektionen anzeigen
nl: Toon pauzes tussen lessen

source: Card Settings
de: Karten-Einstellungen
nl: Kaartinstellingen

source: Tap to customize
de: Zum Anpassen tippen
nl: Tik om aan te passen

source: Number of days to show
de: Anzahl der anzuzeigenden Tage
nl: Aantal dagen om te tonen

source: Number of grades to show
de: Anzahl der anzuzeigenden Noten
nl: Aantal cijfers om te tonen

source: Show only open absences
de: Nur offene Absenzen anzeigen
nl: Toon alleen open afwezigheden

# noConfigurationAvailable
source: No configuration settings available
de: Keine Konfigurationseinstellungen verfügbar
nl: Geen configuratie-instellingen beschikbaar

source: Switch Account
de: Account wechseln
nl: Account wisselen

# noAccounts
source: No accounts available.
de: Keine Accounts verfügbar.
nl: Geen accounts beschikbaar.

# addFirstAccount
source: Add your first account to get started!
de: Fügen Sie Ihren ersten Account hinzu!
nl: Voeg je eerste account toe om te beginnen!

source: Active
de: Aktiv
nl: Actief

source: Available
de: Verfügbar
nl: Beschikbaar

source: Remove Account
de: Account entfernen
nl: Account verwijderen

# confirmRemoveAccount
source: Remove account {email}?
de: Account {email} entfernen?
nl: Account {email} verwijderen?

source: Remove
de: Entfernen
nl: Verwijderen

# switchedAccount
source: Switched to {email}
de: Zu {email} gewechselt
nl: Gewisseld naar {email}

# switchAccountError
source: Failed to switch account: {error}
de: Accountwechsel fehlgeschlagen: {error}
nl: Account wisselen mislukt: {error}

# removedAccount
source: Removed account {email}
de: Account {email} entfernt
nl: Account {email} verwijderd

# removeAccountError
source: Failed to remove account: {error}
de: Account konnte nicht entfernt werden: {error}
nl: Account verwijderen mislukt: {error}

# unexpectedError
source: Unexpected error: {error}
de: Unerwarteter Fehler: {error}
nl: Onverwachte fout: {error}

# weekdayMon
source: Mon
de: Mo
nl: Ma

# weekdayTue
source: Tue
de: Di
nl: Di

# weekdayWed
source: Wed
de: Mi
nl: Wo

# weekdayThu
source: Thu
de: Do
nl: Do

# weekdayFri
source: Fri
de: Fr
nl: Vr

# weekdaySat
source: Sat
de: Sa
nl: Za

# weekdaySun
source: Sun
de: So
nl: Zo

# absencesTabAll
source: All Absences
de: Alle Absenzen
nl: Alle afwezigheden

# absencesTabLateness
source: Lateness
de: Verspätungen
nl: Vertraging

# absencesTabAbsences
source: Absences
de: Absenzen
nl: Afwezigheden

# absencesTabNotices
source: Notices
de: Meldungen
nl: Meldingen

# absencesSection
source: Absences
de: Absenzen
nl: Afwezigheden

# latenessSection
source: Lateness
de: Verspätungen
nl: Vertraging

# noticesSection
source: Notices
de: Meldungen
nl: Meldingen

# noticeItem
source: Notice
de: Meldung
nl: Melding

source: No reason given
de: Kein Grund angegeben
nl: Geen reden opgegeven

source: No comment given
de: Kein Kommentar angegeben
nl: Geen opmerking opgegeven

source: Unknown data
de: Unbekannte Daten
nl: Onbekende gegevens

source: No notices found.
de: Keine Meldungen gefunden.
nl: Geen meldingen gevonden.

source: minutes
de: Minuten
nl: min

# hours
source: hr
de: Std.
nl: uur

source: Lateness from
de: Verspätung vom
nl: Vertraging vanaf

source: Duration
de: Dauer
nl: Duur

source: Course
de: Kurs
nl: Cursus

source: Reason
de: Grund
nl: Reden

source: Comment
de: Kommentar
nl: Opmerking

source: Excused
de: Entschuldigt
nl: Geëxcuseerd

source: Not excused
de: Nicht entschuldigt
nl: Niet geëxcuseerd

source: From
de: Von
nl: Van

source: To
de: Bis
nl: Tot

source: Excuse until
de: Entschuldigen bis
nl: Excuseren tot

source: Excuse
de: Entschuldigen
nl: Excuus

source: Excuse - Coming Soon!
de: Entschuldigung - Kommt bald!
nl: Excuus - Binnenkort!

# deleteAbsenceTitle
source: Delete Absence
de: Absenz löschen
nl: Afwezigheid verwijderen

# deleteAbsenceConfirm
source: Are you sure you want to delete this absence? This action cannot be undone.
de: Sind Sie sicher, dass Sie diese Absenz löschen möchten? Diese Aktion kann nicht rückgängig gemacht werden.
nl: Weet je zeker dat je deze afwezigheid wilt verwijderen? Deze actie kan niet ongedaan worden gemaakt.

source: Absence deleted!
de: Absenz gelöscht!
nl: Afwezigheid verwijderd!

source: Ready to test
de: Bereit zum Testen
nl: Klaar om te testen

source: Update System Test
nl: Update systeem test

source: Checking...
de: Überprüfe...
nl: Controleren...

source: Force Show Update Dialog
de: Update-Dialog erzwingen
nl: Forceer update dialoog

source: Clear Dismissed Updates
de: Verworfene Updates löschen
nl: Wis afgewezen updates

source: How it works:
de: So funktioniert es:
nl: Hoe het werkt:

# updateStep1
source: 1. Checks GitHub releases for newer versions
de: 1. Überprüft GitHub Releases auf neuere Versionen
nl: 1. Controleert GitHub releases voor nieuwere versies

# updateStep2
source: 2. Downloads APK from GitHub release assets
de: 2. Lädt APK von GitHub Release Assets herunter
nl: 2. Download APK van GitHub release assets

# updateStep3
source: 3. Opens Android installer automatically
de: 3. Öffnet Android Installer automatisch
nl: 3. Opent Android installer automatisch

# updateStep4
source: 4. Remembers dismissed updates until app restart
de: 4. Merkt sich verworfene Updates bis zum App-Neustart
nl: 4. Onthoudt afgewezen updates tot app herstart

source: Checking for updates...
de: Suche nach Updates...
nl: Controleren op updates...

# updateAvailableVersion
source: Update available: v{version}
de: Update verfügbar: v{version}
nl: Update beschikbaar: v{version}

# noUpdatesAvailable
source: No updates available or update dismissed
de: Keine Updates verfügbar oder Update verworfen
nl: Geen updates beschikbaar of update afgewezen

# errorCheckingUpdates
source: Error checking for updates: {error}
de: Fehler beim Suchen nach Updates: {error}
nl: Fout bij controleren op updates: {error}

source: Showing update dialog...
de: Zeige Update-Dialog...
nl: Update dialoog tonen...

source: Update dialog shown
de: Update-Dialog angezeigt
nl: Update dialoog getoond

# errorShowingDialog
source: Error showing dialog: {error}
de: Fehler beim Anzeigen des Dialogs: {error}
nl: Fout bij tonen dialoog: {error}

source: Clearing dismissed updates...
de: Lösche verworfene Updates...
nl: Afgewezen updates wissen...

source: Dismissed updates cleared
de: Verworfene Updates gelöscht
nl: Afgewezen updates gewist

# errorClearingDismissed
source: Error clearing dismissed: {error}
de: Fehler beim Löschen verworfener Updates: {error}
nl: Fout bij wissen afgewezen: {error}

source: Illness
de: Krankheit
nl: Ziekte

source: Accident
de: Unfall
nl: Ongeval

source: Military
de: Militär
nl: Militair

# medicalCertificateForSport
source: Valid medical certificate for sports
de: Gültiges Arztzeugnis für Sport
nl: Geldig medisch attest voor sport

source: Other absence
de: Andere Absenz
nl: Andere afwezigheid

source: Create new absence
de: Neue Absenz erfassen
nl: Nieuwe afwezigheid aanmaken

# reasonRequired
source: Reason *
de: Grund *
nl: Reden *

source: Create
de: Erfassen
nl: Aanmaken

source: No error
de: Kein Fehler
nl: Geen fout

source: Unknown
de: Unbekannt
nl: Onbekend

source: Current: {version}
de: Aktuell: {version}
nl: Huidig: {version}

source: Latest: {version}
de: Neueste: {version}
nl: Laatste: {version}

# downloadingUpdate
source: Update is being downloaded...
de: Update wird heruntergeladen...
nl: Update wordt gedownload...

# installingUpdate
source: Update is being installed...
de: Update wird installiert...
nl: Update wordt geïnstalleerd...

source: Install
de: Installieren
nl: Installeren

source: Downloading...
de: Wird heruntergeladen...
nl: Downloaden...

source: Download
de: Herunterladen
nl: Downloaden

source: Installing...
de: Wird installiert...
nl: Installeren...

# downloadError
source: Error downloading update
de: Fehler beim Herunterladen des Updates
nl: Fout bij downloaden update

# downloadErrorDetails
source: Download error: {error}
de: Download Fehler: {error}
nl: Download fout: {error}

source: Installation not allowed
de: Installation nicht erlaubt
nl: Installatie niet toegestaan

source: Installation error
de: Fehler bei der Installation
nl: Installatiefout

# installationErrorDetails
source: Installation error: {error}
de: Installation Fehler: {error}
nl: Installatiefout: {error}

source: Update installation started
de: Update Installation gestartet
nl: Update installatie gestart
