Repository: PianoNic/Schuly
Catalog: schuly/lib/l10n/app_*.arb
Languages: de, nl

source: Absent from *
de: Abwesend von *
nl: Afwezig vanaf *

source: Absent to *
de: Abwesend bis *
nl: Afwezig tot *

# toDateMustBeAfterFromDate
source: End date must be after start date
de: Bis-Datum muss nach Von-Datum liegen
nl: Einddatum moet na begindatum zijn

source: Absent from (time)
de: Abwesend ab (Uhrzeit)
nl: Afwezig vanaf (tijd)

source: Absent to (time)
de: Abwesend bis (Uhrzeit)
nl: Afwezig tot (tijd)

source: Absence created successfully!
de: Absenz erfolgreich erfasst!
nl: Afwezigheid succesvol aangemaakt!

source: Customize homepage
de: Start-Seite anpassen
nl: Homepage aanpassen

source: Visible
de: Sichtbar
nl: Zichtbaar

source: Hidden
de: Ausgeblendet
nl: Verborgen

source: PushAssist Notifications
de: PushAssist Benachrichtigungen
nl: PushAssist meldingen

source: Notifications before classes
de: Benachrichtigungen vor Schulstunden
nl: Meldingen voor lessen

source: Test Notifications
de: Test Benachrichtigungen
nl: Test meldingen

# testNotificationDescription
source: Test notification for PushAssist
de: Test Benachrichtigung für PushAssist
nl: Test melding voor PushAssist

# nextClass
source: Next class: {subject}
de: Nächste Stunde: {subject}
nl: Volgende les: {subject}

# roomAndTeacher
source: Room: {room}{teacher}
de: Raum: {room}{teacher}
nl: Lokaal: {room}{teacher}

# teacher
source: â€¢ Teacher: {teacher}
de: • Lehrer: {teacher}
nl: • Docent: {teacher}

# vibrationTest
source: ðŸ”” PushAssist Vibration Test
de: 🔔 PushAssist Vibration Test
nl: 🔔 PushAssist triltest

# vibrationTestMessage
source: This notification should vibrate! Check your device settings if it doesn't.
de: Diese Benachrichtigung sollte vibrieren! Prüfen Sie Ihre Geräteeinstellungen falls nicht.
nl: Deze melding zou moeten trillen! Controleer je apparaatinstellingen als het niet werkt.

# monday
source: Mon
de: Mo
nl: Ma

# tuesday
source: Tue
de: Di
nl: Di

# wednesday
source: Wed
de: Mi
nl: Wo

# thursday
source: Thu
de: Do
nl: Do

# friday
source: Fri
de: Fr
nl: Vr

# saturday
source: Sat
de: Sa
nl: Za

# sunday
source: Sun
de: So
nl: Zo

source: January
de: Januar
nl: Januari

source: February
de: Februar
nl: Februari

source: March
de: März
nl: Maart

source: May
de: Mai
nl: Mei

source: June
de: Juni
nl: Juni

source: July
de: Juli
nl: Juli

source: August
nl: Augustus

source: October
de: Oktober
nl: Oktober

# studentIdCardTooltip
source: Student ID card
de: Schülerausweis
nl: Studentenkaart

# customizeHomepageTooltip
source: Customize homepage
de: Start-Seite anpassen
nl: Homepage aanpassen

# switchAccountButton
source: Switch account
de: Account wechseln
nl: Account wisselen

# fetchingAppInfo
source: Fetching app information...
de: App-Informationen abrufen...
nl: App-informatie ophalen...

# checkingUpdatesInitialization
source: Checking for updates...
de: Updates überprüfen...
nl: Controleren op updates...

source: Loading data...
de: Daten laden...
nl: Gegevens laden...

source: Finalizing initialization...
de: Initialisierung abschließen...
nl: Initialisatie afronden...

source: Checking connection...
de: Verbindung wird überprüft...
nl: Verbinding controleren...

# offlineModeDetected
source: Offline mode - using cached data
de: Offline-Modus - verwende gespeicherte Daten
nl: Offline modus - gecachte gegevens gebruiken

source: Loading cached data...
de: Lade gespeicherte Daten...
nl: Gecachte gegevens laden...

# errorCheckingUpdatesDetails
source: Error checking for updates: {error}
de: Fehler beim Suchen nach Updates: {error}
nl: Fout bij controleren op updates: {error}

# privacyAndDataCollection
source: Privacy & Data Collection
de: Datenschutz & Datenerfassung
nl: Privacy & Gegevensverzameling

source: Welcome to Schuly!
de: Willkommen bei Schuly!
nl: Welkom bij Schuly!

# privacyConsentIntro
source: To help us improve your experience and fix issues quickly, we collect error reports when the app crashes or encounters problems.
de: Um Ihre Erfahrung zu verbessern und Probleme schnell zu beheben, sammeln wir anonyme Fehlerberichte und Nutzungsdaten.
nl: Om uw ervaring te verbeteren en problemen snel op te lossen, verzamelen we foutrapporten wanneer de app crasht of problemen ondervindt.

source: What we collect:
de: Was wir sammeln:
nl: Wat we verzamelen:

source: What we DON'T collect:
de: Was wir NICHT sammeln:
nl: Wat we NIET verzamelen:

source: Error Reports
de: Fehlerberichte
nl: Foutrapporten

# errorReportsDesc
source: Stack traces, error messages, and breadcrumbs to help us fix bugs
de: App-Abstürze und Fehlermeldungen, um uns bei der Fehlerbehebung zu helfen
nl: Stack traces, foutmeldingen en breadcrumbs om bugs op te lossen

source: Device Information
de: Geräteinformationen
nl: Apparaatinformatie

# deviceInformationDesc
source: Device model, OS version, screen size, memory, battery level, and app version
de: Gerätetyp, Betriebssystemversion und App-Version
nl: Apparaatmodel, OS-versie, schermgrootte, geheugen, batterijniveau en app-versie

source: Performance Data
de: Leistungsdaten
nl: Prestatiegegevens

# performanceDataDesc
source: API response times, app lifecycle events, and memory usage
de: App-Leistungsmetriken zur Verbesserung der Geschwindigkeit und Zuverlässigkeit
nl: API-responstijden, app-lifecycle-gebeurtenissen en geheugengebruik

source: Usage Patterns
de: Nutzungsmuster
nl: Gebruikspatronen

# usagePatternsDesc
source: Navigation breadcrumbs and API operations performed (fetchAll, etc.)
de: Navigations-Breadcrumbs und durchgeführte API-Operationen (fetchAll, etc.)
nl: Navigatie-breadcrumbs en uitgevoerde API-operaties (fetchAll, enz.)

source: User Context
de: Benutzerkontext
nl: Gebruikerscontext

# userContextDesc
source: Your email address (for identifying issues specific to your account)
de: Ihre E-Mail-Adresse (zur Identifizierung kontospezifischer Probleme)
nl: Uw e-mailadres (voor het identificeren van accountspecifieke problemen)

source: Personal Data
de: Persönliche Daten
nl: Persoonlijke Gegevens

# personalDataDesc
source: Your grades, schedule content, notes, and personal messages stay private
de: Ihre Noten, Stundenplan und persönlichen Informationen bleiben privat
nl: Uw cijfers, roosterinhoud, notities en persoonlijke berichten blijven privé

source: Credentials
de: Zugangsdaten
nl: Inloggegevens

# credentialsDesc
source: Your passwords, authentication tokens, and sensitive API responses are filtered out
de: Ihre Passwörter und Authentifizierungs-Token werden niemals gesendet
nl: Uw wachtwoorden, authenticatietokens en gevoelige API-antwoorden worden uitgefilterd

# privacyConsentChangeAnytime
source: You can change this setting anytime in the app settings.
de: Sie können diese Einstellung jederzeit in den App-Einstellungen ändern.
nl: U kunt deze instelling op elk moment wijzigen in de app-instellingen.

# privacyConsentHelpMessage
source: Error reports include your email address for debugging purposes. This data is only used to fix bugs and improve app stability. By consenting, you help make Schuly better for everyone.
de: Diese Daten helfen uns bei unserem Engagement für Qualität und kontinuierliche Verbesserung. Mit Ihrer Zustimmung helfen Sie, Schuly für alle besser zu machen.
nl: Foutrapporten bevatten uw e-mailadres voor debugdoeleinden. Deze gegevens worden alleen gebruikt om bugs op te lossen en de app-stabiliteit te verbeteren. Door toestemming te geven helpt u Schuly beter te maken voor iedereen.

# privacyConsentDecline
source: Decline
de: Ablehnen
nl: Weigeren

# privacyConsentAccept
source: Accept & Continue
de: Akzeptieren & Fortfahren
nl: Accepteren & Doorgaan

source: Error Tracking
de: Fehlerverfolgung
nl: Foutopsporing

# errorTrackingEnabledDesc
source: Help improve app stability by sharing error reports with debugging context
de: Helfen Sie die App-Stabilität zu verbessern, indem Sie anonyme Fehlerberichte teilen
nl: Help de app-stabiliteit te verbeteren door foutrapporten met debug-context te delen

# errorTrackingDisabledDesc
source: Error tracking is disabled
de: Fehlerverfolgung ist deaktiviert
nl: Foutopsporing is uitgeschakeld

# errorTrackingEnabled
source: Thank you! Error tracking has been enabled.
de: Danke! Die Fehlerverfolgung wurde aktiviert.
nl: Bedankt! Foutopsporing is ingeschakeld.

# errorTrackingDisabled
source: Error tracking has been disabled. Please restart the app for changes to take effect.
de: Die Fehlerverfolgung wurde deaktiviert. Bitte starten Sie die App neu, damit die Änderungen wirksam werden.
nl: Foutopsporing is uitgeschakeld. Start de app opnieuw op om de wijzigingen door te voeren.

# errorTrackingRestartRequired
source: Please restart the app for changes to take effect.
de: Bitte starten Sie die App neu, damit die Änderungen wirksam werden.
nl: Start de app opnieuw op om de wijzigingen door te voeren.

source: minute
nl: minuut

source: before class
de: vor dem Unterricht
nl: voor de les

source: Notification Permissions
de: Benachrichtigungsberechtigungen
nl: Meldingstoestemmingen

# notificationPermissionsDescription
source: To receive timely notifications about your classes, please grant the following permissions:
de: Um rechtzeitig Benachrichtigungen über Ihren Unterricht zu erhalten, erteilen Sie bitte die folgenden Berechtigungen:
nl: Om tijdige meldingen over je lessen te ontvangen, verleen de volgende toestemmingen:

# notificationPermission
source: Notifications
de: Benachrichtigungen
nl: Meldingen

# notificationPermissionDesc
source: Allow Schuly to send you notifications
de: Schuly erlauben, Ihnen Benachrichtigungen zu senden
nl: Sta Schuly toe om je meldingen te sturen

# exactAlarmPermission
source: Exact Alarms
de: Exakte Alarme
nl: Exacte alarmen

# exactAlarmPermissionDesc
source: Required for precise notification timing
de: Erforderlich für präzise Benachrichtigungszeiten
nl: Vereist voor precieze melding timing

source: Battery Optimization
de: Akkuoptimierung
nl: Batterij optimalisatie

# batteryOptimizationDesc
source: Disable battery optimization for reliable notifications
de: Akkuoptimierung deaktivieren für zuverlässige Benachrichtigungen
nl: Schakel batterij optimalisatie uit voor betrouwbare meldingen

source: Grant
de: Erteilen
nl: Verlenen

# allPermissionsGranted
source: All permissions granted! Notifications will work reliably.
de: Alle Berechtigungen erteilt! Benachrichtigungen funktionieren zuverlässig.
nl: Alle toestemmingen verleend! Meldingen werken betrouwbaar.

# somePermissionsMissing
source: Some permissions are missing. Notifications may not work as expected.
de: Einige Berechtigungen fehlen. Benachrichtigungen funktionieren möglicherweise nicht wie erwartet.
nl: Sommige toestemmingen ontbreken. Meldingen werken mogelijk niet zoals verwacht.

source: Remind Later
de: Später erinnern
nl: Later herinneren

source: Continue Anyway
de: Trotzdem fortfahren
nl: Toch doorgaan

source: Done
de: Fertig
nl: Klaar

source: Check Permissions
de: Berechtigungen prüfen
nl: Controleer toestemmingen

source: Related Notices
de: Zugehörige Meldungen
nl: Gerelateerde meldingen

source: Exam
de: Prüfung
nl: Examen

source: Date
de: Datum
nl: Datum

source: Time
de: Zeit
nl: Tijd

source: Student Reason
de: Begründung des Schülers
nl: Student reden

source: Trainer Comment
de: Kommentar des Lehrers
nl: Trainer opmerking

source: Unexcused Absences
de: Unentschuldigte Absenzen
nl: Ongeëxcuseerde afwezigheden

# reAuthenticationCancelled
source: Re-authentication cancelled. Some features may not work.
de: Erneute Authentifizierung abgebrochen. Einige Funktionen funktionieren möglicherweise nicht.
nl: Her-authenticatie geannuleerd. Sommige functies werken mogelijk niet.

source: View app debug logs
de: App-Debug-Logs anzeigen
nl: Bekijk app debug logs

source: Buy me a coffee
de: Kauf mir einen Kaffee
nl: Koop een koffie voor me

# supportDevelopment
source: Support the development
de: Unterstütze die Entwicklung
nl: Ondersteun de ontwikkeling

# couldNotOpenBuyMeACoffee
source: Could not open Buy Me a Coffee page
de: Buy Me a Coffee-Seite konnte nicht geöffnet werden
nl: Kon Buy Me a Coffee pagina niet openen

source: OR
de: ODER
nl: OF

source: Sign in with Microsoft
de: Mit Microsoft anmelden
nl: Inloggen met Microsoft

source: Clear logs
de: Logs löschen
nl: Logs wissen

source: Export logs
de: Logs exportieren
nl: Logs exporteren

source: All
de: Alle
nl: Alles

source: Warning
de: Warnung
nl: Waarschuwing

source: Enable logging
de: Protokollierung aktivieren
nl: Logging inschakelen

source: Clear filters
de: Filter löschen
nl: Filters wissen

source: Log copied to clipboard
de: Log in Zwischenablage kopiert
nl: Log gekopieerd naar klembord

source: Clear all logs?
de: Alle Logs löschen?
nl: Alle logs wissen?

source: This action cannot be undone.
de: Diese Aktion kann nicht rückgängig gemacht werden.
nl: Deze actie kan niet ongedaan worden gemaakt.

source: Logs cleared
de: Logs gelöscht
nl: Logs gewist

source: Clear
de: Löschen
nl: Wissen

source: Logs exported to clipboard
de: Logs in Zwischenablage exportiert
nl: Logs geëxporteerd naar klembord

# endpointReachable
source: Endpoint reachable ({statusCode})
de: Endpunkt erreichbar ({statusCode})
nl: Eindpunt bereikbaar ({statusCode})

# serverError
source: Server error: {statusCode}
de: Serverfehler: {statusCode}
nl: Serverfout: {statusCode}

# failedToInitializeMicrosoftAuth
source: Failed to initialize Microsoft authentication: {error}
de: Microsoft-Authentifizierung konnte nicht initialisiert werden: {error}
nl: Microsoft authenticatie initialisatie mislukt: {error}

# authenticationFailed
source: Authentication failed: {error}
de: Authentifizierung fehlgeschlagen: {error}
nl: Authenticatie mislukt: {error}

source: No internet connection
de: Keine Internetverbindung
nl: Geen internetverbinding

source: Upcoming Tests
de: Anstehende Prüfungen
nl: Aankomende toetsen

source: No tests found
de: Keine Prüfungen gefunden
nl: Geen toetsen gevonden

source: No upcoming tests
de: Keine anstehenden Prüfungen
nl: Geen aankomende toetsen

source: Room
de: Raum
nl: Lokaal

source: Weight
de: Gewichtung
nl: Gewicht

source: Number of tests to show
de: Anzahl der anzuzeigenden Prüfungen
nl: Aantal toetsen om te tonen

source: Today
de: Heute
nl: Vandaag

source: Card View
de: Kartenansicht
nl: Kaartweergave

# cardViewDescription
source: Detailed cards with expandable test info
de: Detaillierte Karten mit erweiterbaren Testinformationen
nl: Gedetailleerde kaarten met uitklapbare test info

source: Timeline View
de: Zeitachsenansicht
nl: Tijdlijn weergave

# timelineViewDescription
source: Compact timeline with time-based layout
de: Kompakte Zeitachse mit zeitbasiertem Layout
nl: Compacte tijdlijn met tijd-gebaseerde indeling

source: Share your Maggus level
de: Teile dein Maggus-Level
nl: Deel je Maggus-level

# myMaggusScore
source: My Maggus Score: {score} Points!
de: Mein Maggus-Score: {score} Punkte!
nl: Mijn Maggus-Score: {score} Punten!

# testYourMaggusLevel
source: Test your own Maggus level in the Schuly App!
de: Teste deinen eigenen Maggus-Level in der Schuly App!
nl: Test je eigen Maggus-level in de Schuly app!

source: Grade Display Settings
de: Notenanzeigeeinstellungen
nl: Cijferweergave-instellingen

# chooseGradeDisplay
source: Choose how grades are displayed:
de: Wähle wie Noten angezeigt werden:
nl: Kies hoe cijfers worden weergegeven:

source: Exact Grades
de: Exakte Noten
nl: Exacte cijfers

# exactGradesDesc
source: Show precise grade values
de: Zeige präzise Notenwerte
nl: Toon precieze cijferwaarden

# roundedGrades
source: Report Card Grades
de: Zeugnisnoten
nl: Rapportcijfers

# roundedGradesDesc
source: Rounded to nearest 0.5 (Zeugnisnote)
de: Gerundet auf 0.5 (Zeugnisnote)
nl: Afgerond op 0,5 (rapportcijfer)

# bothGrades
source: Both
de: Beides
nl: Beide

# bothGradesDesc
source: Show exact and rounded grades
de: Zeige exakte und gerundete Noten
nl: Toon exacte en afgeronde cijfers

# gradeRoundingInfo
source: Report card grades are rounded to the nearest 0.5 as they appear on official documents.
de: Zeugnisnoten werden auf die nächste 0.5 gerundet, wie sie auf offiziellen Dokumenten erscheinen.
nl: Rapportcijfers worden afgerond op de dichtstbijzijnde 0,5 zoals ze op officiële documenten verschijnen.

source: App Information
de: App-Informationen
nl: App-Informatie

source: Overview
de: Übersicht
nl: Overzicht

source: Statistics
de: Statistiken
nl: Statistieken

source: Later
de: Später

source: Neon Violet
de: Neon Violett

source: December
de: Dezember

source: Console Logs
de: Konsolen-Logs

source: Grade Colors
de: Notenfarben

source: Use Grade Colors
de: Notenfarben verwenden

# useGradeColorsDesc
source: Color grades based on their value
de: Noten basierend auf ihrem Wert einfärben

# redThreshold
source: Red (below)
de: Rot (unter)

# yellowThreshold
source: Yellow (below)
de: Gelb (unter)

# greenThreshold
source: Green
de: Grün

source: Preview
de: Vorschau
